{	
	"parameters":	{
						"usbAddress": "None",
						"ipAddress": "None",
						"terminationCharacters": "\n",
						"serialTimeout": "None"
					},
	"commands": 	{
						"get_id": 		{ 
											"commandString": "*IDN?",
											"arguments": "",
											"description": "This query requests the electronic load to identify itself"
										},
						"reset": 		{ 
											"commandString": "*RST",
											"arguments": "",
											"description": "This command sets the electronic load to its factory-defined state (refer to 'Facctory Default Settings' in the Operating Manual of the electronic load model that you are programming). There are no parameters with this command; it sets all channels of the multiple electronic load to the same state."
										},										
						"set_input": 	{ 
											"commandString": "INPut %s",
											"arguments": "input {OFF|ON}",
											"description": "This implied keyword turns the electronic load input ON and OFF. When INPut is OFF, the electronic load will draw minimal current at its input. INP[STAT]e:OFF overrides INPut:SHORt:ON. The presently programmed slew rate setting is not used when turning the input on or off; the current and voltage change at their maximum rates."
										},
						"set_voltage": 	{ 
											"commandString": "VOLTage %s",
											"arguments": "voltage {<voltage>}",
											"description": "This implied keyword specifies the value of the programmed voltage level and whether that level is to be applied immediately or on occurrence of a trigger. If the specified channel is in the Voltage Mode, an IMMediate voltage level is transferred to the input as soon as the command is executed. A TRIGgered level is stored and transferred to the input when a trigger occurs. At that time, the change to the input level occurs at the slew rate presently in effect. Following the trigger event, subsequent triggers will not affect the input level unless the electronic load has been sent another TRIGgered level command. If the electronic load is not in the CV (Constant-Voltage) Mode when an IMMediate or TRIGgered level command is sent, the programmed levels are saved for the next time the electronic load is placed in the CV Mode. Triggered levels are processed by the Voltage Subsystem even when the electronic load is not in the CV Mode. Thus, the TRIGgered level becomes a stored IMMediate level that takes effect when the electronic load is again in the CV Mode."
										},
						"set_current": 	{ 
											"commandString": "CURRent %s",
											"arguments": "current {<current>}",
											"description": "This implied keyword specifies the value of the programmed current level and whether that level is to be applied immediately or on occurrence of a trigger. If the specified channel is in the CC (constant-current) Mode, an IMMediate current level is transferred to the input as soon as the command is executed. A TRIGgered level is stored and transferred to the input when a trigger occurs. At that time, the change to the input level occurs at the slew rate presently in effect. Following the trigger event, subsequent triggers will not affect the input level unless the electronic load has been sent another TRIGgered level command. If the electronic load is not in the CC (Constant-Current) Mode when an IMMediate or TRIGgered level command is sent, the programmed levels are saved for the next time the electronic load is placed in the CC Mode. Triggered levels are processed by the Current Subsystem even when the electronic load is not in the CC Mode. Thus, the TRIGgered level becomes a stored IMMediate level that takes effect when the electronic load is again in the CC Mode."
										},
						"set_resistance": { 
											"commandString": "RESistance %s",
											"arguments": "resistance {<resistance>}",
											"description": "This is an implied keyword that specifies the value of the programmed input resistance and whether that value is to be applied immediately or on occurrence of a trigger. If the specified channel is in the CR (constant-resistance) Mode, an IMMediate resistance level is transferred to the input as soon as the command is executed. A TRIGgered level is stored and transferred to the input when a trigger occurs. At that time, the change to the input level occurs at the presently active voltage slew rate (for the lowest resistance range) or presently active current slew rate (for the middle and highest ranges). Following the trigger event, subsequent triggers will not affect the input level unless the electronic load has been sent another TRIGgered level command. If the electronic load is not in the CR (Constant-Resistance) Mode when an IMMediate or TRIGgered level command is sent, the programmed levels are saved for the next time the electronic load is placed in the CR Mode. Triggered levels are processed by the Resistance Subsystem even when the electronic load is not in the CR Mode. Thus, the TRIGgered level becomes a stored IMMediate level that takes effect when the electronic load is again in the CR Mode."
										},
						"set_transient_voltage": { 
											"commandString": "VOLTage:TLEVel %s",
											"arguments": "voltage {<voltage>}",
											"description": "This command specifies the value of the programmed voltage level for the TRANsient input when the electronic load is in the CV (constant-voltage) Mode. When the Transient Subsystem is on, the electronic load input voltage will switch (under control of the Transient Subsystem) between the main level and TLEVel at a rate determined by the present value of SLEW. In order for input voltage level switching to occur, TLEVel must be greater than the main level. If TLEVel is set to a value below the main level, no error is generated but switching will not occur until the main level is subsequently programmed below the value of TLEVel. If TLEVel is programmed outside the specified range, an error is generated (see Table 4-2 at the end of this chapter)."
										},
						"set_transient_current": { 
											"commandString": "CURRent:TLEVel %s",
											"arguments": "current {<current>}",
											"description": "This command specifies the value of the programmed current level for the TRANsient input when the electronic load is in the CC (constant-current) Mode. When the Transient Subsystem is on, the electronic load input current will switch (under control of the Transient Subsystem) between the main level and TLEVel at a rate determined by the present value of SLEW. In order for the input current level to switch, TLEVel must be set to a value greater than the main level. If TLEVel is set to a value below the main level, no error is generated but switching will not occur until the main level is subsequently programmed below the value of TLEVel. If TLEVel is programmed outside the specified range, an error is generated (see Table 4-2 at the end of this chapter)."
										},
						"set_transient_resistance": { 
											"commandString": "RESistance:TLEVel %s",
											"arguments": "resistance {<resistance>}",
											"description": "This command specifies the value of the programmed resistance level for the TRANsient input when the electronic load is in the CR (constant-resistance) Mode. When the Transient Subsystem is on, the electronic load input resistance will switch (under control of the Transient Subsystem) between the main resistance and TLEVel at a rate determined by the present value of VOLT:SLEW (lowest resistance range) or by CURR:SLEW (middle and high resistance ranges). In order for input resistance level switching to occur, TLEVel must be programmed as follows: Lowest range: TLEVel > LEVel, Middle and highest ranges: TLEVel < LEVel. If the above rules are not followed, no error is generated but switching will not occur. If the main resistance is subsequently programmed to the proper level with respect to TLEVel, switching will begin provided the TRANsient subsystem is on. If TLEVel is programmed outside the specified range, an error is generated (see Table 4-2 at the end of this chapter)."
										},
						"set_range_current": { 
											"commandString": "CURRent:RANGe %s",
											"arguments": "range {<current>}",
											"description": "This command selects the full-scale current range the electronic load. Programming any value within the low range automatically selects the low range and programming any value within the high range automatically selects that range. In the HP6060A for example, programming a value from 6 to 60 amperes automatically selects the 60-ampere range."
										},
						"set_range_resistance": { 
											"commandString": "RESistance:RANGe %s",
											"arguments": "range {<resistance>}",
											"description": "This command selects the full-scale resistance range the electronic load. Programming any value equal to or greater than zero (>= 0) and less than or equal to (<=) the maximum value of the lowest range automatically selects that range. Programming any value greater than the minimum range and less than or equal the middle range automatically selects that range. There is no overlap between the low and middle ranges. Programming a value greater than the maximum value of the middle range automatically selects the highest range."
										},
						"set_slew_voltage": { 
											"commandString": "VOLTage:SLEW %s",
											"arguments": "slew {<slew (volts/second)>}",
											"description": "This command sets the voltage programming slew rate and the resistance programming slew rate for lowest CR range. The programmed slew rate remains in effect for all programmed voltage changes except INPut ON or OFF. The hardware implements discrete slew rates (refer to the Electronic Load Operating Manual) and automatically selects the one that is closest to the programmed value. To determine the actual value, use the query VOLT:SLEW?."
										},
						"set_slew_current": { 
											"commandString": "CURRent:SLEW %s",
											"arguments": "slew {<slew (amps/second)>}",
											"description": "This command sets the current programming slew rate for both CC mode ranges and the resistance programming slew rate for the middle and high CR mode ranges. The programmed slew rate is used for all programmed current changes except INPut ON or OFF. The hardware implements discrete slew rates (refer to the Electronic Load Operating Manual) and automatically selects the one that is closest to the programmed value. To determine the actual value, use the query CURR:SLEW?."
										},
						"set_mode": 	{ 
											"commandString": "MODE:%s",
											"arguments": "mode {CURRent|RESistance|VOLTage}",
											"description": "This command selects the operating mode of the electronic load, which can be: CURRent Constant-current (CC) input, RESistance Constant-resistance (CR) input, VOLTage Constant-voltage (CV) input. If the mode is changed while the input is on, the input is mommentarily turned of as if INPut[:STATe] OFF were executed. However, changing modes does not change the state of the input nor does it turn off the TRANsient function. For multiple electronic loads, the mode of each channel is programmed independently."
										},
						"get_programmed_voltage": { 
											"commandString": "VOLTage?",
											"arguments": "",
											"description": "This query returns the presently programmed voltage level."
										},
						"get_programmed_current": { 
											"commandString": "CURRent?",
											"arguments": "",
											"description": "This query returns the presently programmed current level."
										},
						"get_programmed_resistance": { 
											"commandString": "RESistance?",
											"arguments": "",
											"description": "This query returns the presently programmed input resistance level."
										},
						"get_voltage": 	{ 
											"commandString": "MEASure:VOLTage?",
											"arguments": "",
											"description": "This function consists of queries that return the current, voltage, and power at the input of the electronic load."
										},
						"get_current": 	{ 
											"commandString": "MEASure:CURRent?",
											"arguments": "",
											"description": "This function consists of queries that return the current, voltage, and power at the input of the electronic load."
										},
						"get_power": 	{ 
											"commandString": "MEASure:POWer?",
											"arguments": "",
											"description": "This function consists of queries that return the current, voltage, and power at the input of the electronic load."
										},
						"get_error": 	{ 
											"commandString": "SYSTem:ERRor?",
											"arguments": "",
											"description": "This query reads the remote programming error queue of the electronic load. The queue, which operates in a FIFO (first-in-first-out) mode, records only programming errors - not front panel errors. As it is read, each error is removed from the queue. When all errors have been read, a zero is returned. Negatively numbered errors are generic HP-SL errors and positively numbered errors are specific to the electronic load. (see Table 4-2 at the end of this chapter) If the error queue should become full, error -350 will be returned."
										}									
					}
}